{
  "projects": {
    "fase": {
      "title": "Frontier AI System Evaluations",
      "description": "FASE is an initiative to develop evolving, community-driven evaluation frameworks for AI. The project builds domain-specific benchmarks, simulators for autonomous AI systems, and methodological standards for rigorous assessment. By enabling open contribution and structured collaboration, FASE supports the creation of reliable, extensible testing grounds for advancing AI capabilities in complex environments.",
      "links": {},
      "image": "manifoldWebsite-images/FASE.png",
      "icon": ""
    },
    "vlm_calibration": {
      "title": "VLM Calibration",
      "description": "The VLM Calibration Project investigates whether large language models can accurately assess the correctness of their own answers. Despite impressive capabilities, VLMs often exhibit overconfidence; even when wrong. This project systematically evaluates model calibration across multiple datasets and architectures, probing the reliability of their self-assessed confidence. By analyzing when and why different models misjudge uncertainty, we aim to improve trust and interpretability in AI systems.",
      "links": {
        "discord_link": {
          "title": "Discord",
          "url": "https://discord.com/channels/755517485096108153/1262117499999092837",
          "description": "Join our VLM Discord Channel"
        },
        "github_link": {
          "title": "GitHub",
          "url": "https://github.com/ManifoldRG/VLMCalibration",
          "description": "View the VLM Calibration code on GitHub"
        }
      },
      "image": "manifoldWebsite-images/VLMCalibration.png",
      "icon": ""
    },
    "multimodal_action_models": {
      "title": "Multimodal Action Models",
      "description": "The Multimodal Action Models project aims to develop AI systems that link perception to action across diverse modalities such as vision, language and sensor data to perform complex tasks in dynamic physical and digital environments. These models integrate understanding and control into unified architectures, enabling generalist agents that can interpret multimodal inputs, reason about goals and take appropriate actions in real world or simulated settings.",
      "links": {
        "discord_link": {
          "title": "Discord",
          "url": "https://discord.com/channels/755517485096108153/1104825004811624488",
          "description": "Join the Multimodal Action Models Discord Channel"
        },
        "github_link": {
          "title": "GitHub",
          "url": "https://github.com/ManifoldRG/NEKO",
          "description": "View the Multimodal Action Models repo"
        }
      },
      "image": "manifoldWebsite-images/MultimodalActionModels.png",
      "icon": ""
    },
    "multinet": {
      "title": "MultiNet",
      "description": "We are building unified benchmarks for AI systems that see, reason, and act. MultiNet standardizes diverse multimodal datasets, spanning vision, language, and action, and provides tools for training and evaluating generalist agents. By enabling consistent pretraining and rigorous end-to-end evaluation, MultiNet advances the development of foundation models capable of perception, understanding, and control.",
      "links": {
        "website": {
          "title": "Website",
          "url": "https://multinet.ai/index.html",
          "description": "Visit the MultiNet Website"
        },
        "discord_link": {
          "title": "Discord",
          "url": "https://discord.com/channels/755517485096108153/1230314669223317544",
          "description": "Join the MultiNet Discord Channel"
        },
        "github_link": {
          "title": "GitHub",
          "url": "https://github.com/ManifoldRG/MultiNet",
          "description": "View the MultiNet repo on GitHub"
        }
      },
      "image": "manifoldWebsite-images/MultiNet.png",
      "icon": ""
    },
    "pivoting_cube_reconfiguration": {
      "title": "Pivoting Cube Reconfiguration",
      "description": "Pivoting Cube Reconfiguration develops path planning strategies for large collectives of magnetically actuated pivoting cubes, enabling rapid shape change through coordinated rotations and simultaneous movements. By treating reconfiguration as a massively parallel process rather than a sequential one, the project explores scalable algorithms that reduce transition time and unlock real-time adaptability for modular robotic structures.",
      "links": {
        "discord_link": {
          "title": "Discord",
          "url": "https://discord.com/channels/755517485096108153/1292306707015274547",
          "description": "Join the PCR Discord Channel"
        },
        "github_link": {
          "title": "GitHub",
          "url": "https://github.com/ManifoldRG/PCR",
          "description": "View the PCR code on GitHub"
        }
      },
      "image": "manifoldWebsite-images/PCR.png",
      "icon": ""
    },
    "damage_responsive_reconfiguration": {
    "title": "Damage Responsive Reconfiguration",
    "description": "Damage Responsive Reconfiguration develops damage-aware reconfiguration strategies for modular robotic structures, enabling them to detect failures and reorganize themselves without human intervention. By leveraging distributed control and adaptive role reassignment, the project ensures that even partially impaired systems can preserve connectivity, maintain function, and continue operating under degraded conditions.",
    "links": {
      "discord_link": {
        "title": "Discord",
        "url": "https://discordapp.com/channels/755517485096108153/1398390905832079562",
        "description": "Join the DRR Discord Channel"
      },
      "github_link": {
        "title": "GitHub",
        "url": "https://github.com/ManifoldRG/DRR",
        "description": "View the DRR code on GitHub"
      }
    },
    "image": "manifoldWebsite-images/DRR.png",
    "icon": ""
    },
     "flying_cube_assembly": {
      "title": "Flying Cube Assembly",
      "description": "Flying Cube Assembly develops centralized coordination and control strategies for modular spacecraft that self-assemble in free flight. Each cube is a fully actuated vehicle, capable of independent translation and rotation, yet guided by a shared sequencing policy that directs docking order and approach geometry. By treating structure formation as a coordinated multi-body rendezvous problem, the project enables precise, repeatable in-orbit assembly without mechanical arms or fixed infrastructure.",
      "links": {},
      "image": "manifoldWebsite-images/FCA.png",
      "icon": ""
    },
    "crowded_orbit_navigation": {
      "title": "Crowded Orbit Navigation",
      "description": "Crowded Orbits develops learning-based controllers for autonomous spacecraft swarms operating in dense orbits. Using a transformer based neural operator, the system learns to generate fuel-efficient maneuvers that avoid both debris and inter-agent collisions. The project leverages distribution-based objectives and orbital mechanics to enable scalable, decentralized navigation in increasingly congested orbital regimes.",
      "links": {},
      "image": "manifoldWebsite-images/CrowdedOrbitNavigation.png",
      "icon": ""
    }
  },
  "research_directions": {
    "golem": {
      "label": "GOLEM",
      "title": "GOLEM",
      "description": "GOLEM (Generalist Omnimodal Learning in Engineered Minds) is a long term research program focused on building AI systems that can perceive, reason, adapt, and act across any input and output modality. The program explores fundamental architectures, training methodologies, and evaluation frameworks needed for AI systems that can process multimodal inputs, generate appropriate outputs, adapt to new situations, and continue learning over time.",
      "projects": {
        "fase": {
          "title": "Frontier AI System Evaluations",
          "description": "FASE is an initiative to develop evolving, community-driven evaluation frameworks for AI.",
          "url": "/fase",
          "icon": ""
        },
        "vlm_calibration": {
          "title": "VLM Calibration",
          "description": "Evaluating how well vision language models know when they’re wrong.",
          "url": "/vlm_calibration",
          "icon": ""
        },
        "multimodal_action_models": {
          "title": "Multimodal Action Models",
          "description": "Connecting vision, language and control for generalist embodied AI.",
          "url": "/multimodal_action_models",
          "icon": ""
        },
        "multinet": {
          "title": "MultiNet",
          "description": "Benchmarking next‑gen Generalist AI: multimodal perception, language, and action.",
          "url": "/multinet",
          "icon": ""
        }
      },
      "image": "manifoldWebsite-images/GOLEM.png"
    },
    "aethermorph": {
      "label": "Aethermorph",
      "title": "Aethermorph",
      "description": "Aethermorph develops intelligent, reconfigurable swarms of modular spacecraft for autonomous construction and servicing in orbit. Unlike traditional space robotics, Aethermorph systems are designed to adapt in real time; physically reassembling, coordinating without central control, and responding to mission goals. Through decentralized learning, emergent behavior, and dynamic morphogenesis, the program lays the groundwork for scalable orbital infrastructure and resilient space operations.",
      "projects": {
        "pivoting_cube_reconfiguration": {
          "title": "Pivoting Cube Reconfiguratoin",
          "description": "Simultaneous reconfiguration of pivoting modular space structures.",
          "url": "/pivoting_cube_assembly",
          "icon": ""
        },
        "flying_cube_assembly": {
          "title": "Flying Cube Assembly",
          "description": "Autonomous assembly of free-flying modular space structures.",
          "url": "/pivoting_cube_assembly",
          "icon": ""
        },
        "damage_responsive_reconfiguration": {
          "title": "Damage Responsive Reconfiguration",
          "description": "Autonomous self-repair through damage-aware modular reconfiguration.",
          "url": "/damage_responsive_reconfiguration",
          "icon": ""
        },
        "crowded_orbit_navigation": {
          "title": "Crowded Orbit Navigation",
          "description": "Neural operator control for collision-free swarm navigation in congested orbital environments.",
          "url": "/crowded_orbit_navigation",
          "icon": ""
        }
      },
      "image": "manifoldWebsite-images/Aethermorph.png"
    }
  }
}
