{
  "projects": {
    "fase": {
      "title": "Frontier AI System Evaluations",
      "description": "FASE is an initiative to develop evolving, community-driven evaluation frameworks for AI. The project builds domain-specific benchmarks, simulators for autonomous AI systems, and methodological standards for rigorous assessment. By enabling open contribution and structured collaboration, FASE supports the creation of reliable, extensible testing grounds for advancing AI capabilities in complex environments.",
      "links": {},
      "image": "manifoldWebsite-images/FASE.png",
      "icon": ""
    },
    "vlm_calibration": {
      "title": "VLM Calibration",
      "description": "The VLM Calibration Project investigates whether large language models can accurately assess the correctness of their own answers. Despite impressive capabilities, VLMs often exhibit overconfidence; even when wrong. This project systematically evaluates model calibration across multiple datasets and architectures, probing the reliability of their self-assessed confidence. By analyzing when and why different models misjudge uncertainty, we aim to improve trust and interpretability in AI systems.",
      "links": {
        "discord_link": {
          "title": "Discord",
          "url": "https://discord.com/channels/755517485096108153/1262117499999092837",
          "description": "Join our VLM Discord Channel"
        },
        "github_link": {
          "title": "GitHub",
          "url": "https://github.com/ManifoldRG/VLMCalibration",
          "description": "View the VLM Calibration code on GitHub"
        }
      },
      "image": "manifoldWebsite-images/VLMCalibration.png",
      "icon": ""
    },
    "multimodal_action_models": {
      "title": "Multimodal Action Models",
      "description": "The Multimodal Action Models project aims to develop AI systems that link perception to action across diverse modalities such as vision, language and sensor data to perform complex tasks in dynamic physical and digital environments. These models integrate understanding and control into unified architectures, enabling generalist agents that can interpret multimodal inputs, reason about goals and take appropriate actions in real world or simulated settings.",
      "links": {
        "discord_link": {
          "title": "Discord",
          "url": "https://discord.com/channels/755517485096108153/1104825004811624488",
          "description": "Join the Multimodal Action Models Discord Channel"
        },
        "github_link": {
          "title": "GitHub",
          "url": "https://github.com/ManifoldRG/NEKO",
          "description": "View the Multimodal Action Models repo"
        }
      },
      "image": "manifoldWebsite-images/MultimodalActionModels.png",
      "icon": ""
    },
    "multinet": {
      "title": "MultiNet",
      "description": "We are building unified benchmarks for AI systems that see, reason, and act. MultiNet standardizes diverse multimodal datasets, spanning vision, language, and action, and provides tools for training and evaluating generalist agents. By enabling consistent pretraining and rigorous end-to-end evaluation, MultiNet advances the development of foundation models capable of perception, understanding, and control.",
      "links": {
        "website": {
          "title": "Website",
          "url": "https://multinet.ai/index.html",
          "description": "Visit the MultiNet Website"
        },
        "discord_link": {
          "title": "Discord",
          "url": "https://discord.com/channels/755517485096108153/1230314669223317544",
          "description": "Join the MultiNet Discord Channel"
        },
        "github_link": {
          "title": "GitHub",
          "url": "https://github.com/ManifoldRG/MultiNet",
          "description": "View the MultiNet repo on GitHub"
        }
      },
      "image": "manifoldWebsite-images/MultiNet.png",
      "icon": ""
    },

    "rapid_reconfiguration": {
      "title": "Rapid Reconfiguration",
      "description": "Rapid Reconfiguration develops scalable planning and coordination strategies for modular robotic collectives to change global shape quickly and reliably. By treating reconfiguration as a massively parallel process rather than a sequential one, the project explores algorithms that reduce transition time, enable simultaneous motion across many modules, and unlock real-time structural adaptability—an essential capability for future programmable matter systems.",
      "links": {
        "discord_link": {
          "title": "Discord",
          "url": "https://discord.com/channels/755517485096108153/1292306707015274547",
          "description": "Join the PCR Discord Channel"
        },
        "github_link": {
          "title": "GitHub",
          "url": "https://github.com/ManifoldRG/Pivoting-Cube-Reconfiguration",
          "description": "View the PCR code on GitHub"
        }
      },
      "image": "manifoldWebsite-images/PCR.png",
      "icon": ""
    },

    "autonomous_self_repair": {
      "title": "Autonomous Self-Repair",
      "description": "Autonomous Self-Repair develops damage-aware strategies that allow modular robotic structures to detect failures and reorganize without human intervention. The project focuses on distributed detection, adaptive role reassignment, and connectivity-preserving reconfiguration so that partially impaired systems can maintain function, continue operating under degraded conditions, and recover useful structure over time—moving beyond redundancy toward true robotic resilience.",
      "links": {
        "discord_link": {
          "title": "Discord",
          "url": "https://discordapp.com/channels/755517485096108153/1398390905832079562",
          "description": "Join the DRR Discord Channel"
        },
        "github_link": {
          "title": "GitHub",
          "url": "https://github.com/ManifoldRG/Damage-Responsive-Reconfiguration",
          "description": "View the DRR code on GitHub"
        }
      },
      "image": "manifoldWebsite-images/DRR.png",
      "icon": ""
    },

    "autonomous_assembly_of_modular_space_structures": {
      "title": "Autonomous Assembly of Modular Space Structures",
      "description": "Autonomous Assembly of Modular Space Structures develops coordination, planning, and control strategies for free-flying modular spacecraft to assemble large structures in orbit. By treating structure formation as a multi-body rendezvous and docking problem—coordinated across many vehicles—the project enables precise, repeatable assembly without fixed infrastructure, supporting the long-term goal of scalable orbital construction sites.",
      "links": {},
      "image": "manifoldWebsite-images/FCA.png",
      "icon": ""
    },

    "cooperative_object_transportation_in_orbit": {
      "title": "Cooperative Object Transportation in Orbit",
      "description": "Cooperative Object Transportation in Orbit develops coordinated autonomy for teams of spacecraft to move, handoff, and position objects in space. Multiple agents act in concert—through shared guidance, distributed optimization, and robust interaction strategies—to achieve precise, fuel-efficient transport under uncertainty, enabling core logistics primitives for in-orbit construction and servicing.",
      "links": {},
      "image": "manifoldWebsite-images/COT.png",
      "icon": ""
    },

    "navigation_in_crowded_orbital_environments": {
      "title": "Navigation in Crowded Orbital Environments",
      "description": "Navigation in Crowded Orbital Environments develops scalable autonomy for spacecraft operating amid debris, traffic, and other agents in dense orbital regimes. The project explores learning-enabled and model-informed control strategies to produce fuel-efficient, collision-free maneuvers with safety constraints, supporting reliable operation as orbits become increasingly congested.",
      "links": {},
      "image": "manifoldWebsite-images/CrowdedOrbitNavigation.png",
      "icon": ""
    }
  },

  "research_directions": {
    "golem": {
      "label": "GOLEM",
      "title": "GOLEM",
      "description": "GOLEM (Generalist Omnimodal Learning in Engineered Minds) is a long term research program focused on building AI systems that can perceive, reason, adapt, and act across any input and output modality. The program explores fundamental architectures, training methodologies, and evaluation frameworks needed for AI systems that can process multimodal inputs, generate appropriate outputs, adapt to new situations, and continue learning over time.",
      "projects": {
        "fase": {
          "title": "Frontier AI System Evaluations",
          "description": "FASE is an initiative to develop evolving, community-driven evaluation frameworks for AI.",
          "url": "/fase",
          "icon": ""
        },
        "vlm_calibration": {
          "title": "VLM Calibration",
          "description": "Evaluating how well vision language models know when they’re wrong.",
          "url": "/vlm_calibration",
          "icon": ""
        },
        "multimodal_action_models": {
          "title": "Multimodal Action Models",
          "description": "Connecting vision, language and control for generalist embodied AI.",
          "url": "/multimodal_action_models",
          "icon": ""
        },
        "multinet": {
          "title": "MultiNet",
          "description": "Benchmarking next-gen Generalist AI: multimodal perception, language, and action.",
          "url": "/multinet",
          "icon": ""
        }
      },
      "image": "manifoldWebsite-images/GOLEM.png"
    },

    "holon": {
      "label": "Holon",
      "title": "Holon",
      "description": "Holon is a long-horizon robotics program focused on cellular, modular robotic systems that can behave as programmable matter. Rather than treating robots as fixed assemblies, Holon explores collectives of simple robotic cells that can reorganize their structure and function in response to task demands and unexpected damage. The program targets foundational capabilities—rapid, parallel shape change and autonomous self-repair—required for resilient, adaptive machines that can operate for long durations in extreme environments.",
      "projects": {
        "rapid_reconfiguration": {
          "title": "Rapid Reconfiguration",
          "description": "Massively parallel shape change for modular robotic systems.",
          "url": "/rapid_reconfiguration",
          "icon": ""
        },
        "autonomous_self_repair": {
          "title": "Autonomous Self-Repair",
          "description": "Self-repair through damage-aware modular reorganization.",
          "url": "/autonomous_self_repair",
          "icon": ""
        }
      },
      "image": "manifoldWebsite-images/Aethermorph.png"
    },

    "the_orbital_yard": {
      "label": "The Orbital Yard",
      "title": "The Orbital Yard",
      "description": "The Orbital Yard is a program to enable autonomous construction in orbit—an orbital shipyard where large space structures are built, moved, and maintained by fleets of robotic workers. The program develops the core primitives required for scalable in-space assembly: autonomous modular structure assembly, cooperative transport and handoff of large objects, and safe navigation in dense orbital environments. Together, these capabilities form a technical foundation for persistent orbital construction sites and future megastructures.",
      "projects": {
        "autonomous_assembly_of_modular_space_structures": {
          "title": "Autonomous Assembly of Modular Space Structures",
          "description": "Autonomous assembly of free-flying modular space structures.",
          "url": "/autonomous_assembly_of_modular_space_structures",
          "icon": ""
        },
        "cooperative_object_transportation_in_orbit": {
          "title": "Cooperative Object Transportation in Orbit",
          "description": "Cooperative transport and positioning of objects in orbit.",
          "url": "/cooperative_object_transportation_in_orbit",
          "icon": ""
        },
        "navigation_in_crowded_orbital_environments": {
          "title": "Navigation in Crowded Orbital Environments",
          "description": "Collision-free autonomy in dense orbital regimes.",
          "url": "/navigation_in_crowded_orbital_environments",
          "icon": ""
        }
      },
      "image": "manifoldWebsite-images/Aethermorph.png"
    }
  }
}
